# Exercise solutions

## Script translation

#### Solution (Python to R)

In [1]:
temperatures_fahrenheit <- c(123, 56, 13, 55, 233)

In [2]:
for (temp in temperatures_fahrenheit) {
    print(temp + 10)
}

[1] 133
[1] 66
[1] 23
[1] 65
[1] 243

In [3]:
temperatures_adjusted <- round((temperatures_fahrenheit - 10) / 2.3, 3)
temperatures_adjusted

[1] 49.130 20.000  1.304 19.565 96.957

In [4]:
adjust_temperature <- function(temp) {
    return(round((temp - 10 / 2.3), 2))
}

In [5]:
adjust_temperature(23)

[1] 18.65

In [6]:
cities <- c("Berlin", "Beijing", "Cairo", "Sao Paolo", "Madrid")
cities_temp_df <- data.frame(cities, temperatures_adjusted)

In [7]:
cities_temp_df

  cities    temperatures_adjusted
1 Berlin    49.130
2 Beijing   20.000
3 Cairo      1.304
4 Sao Paolo 19.565
5 Madrid    96.957

In [8]:
cities_temp_df$cities <- toupper(cities_temp_df$cities)

In [9]:
head(cities_temp_df, 1)

  cities temperatures_adjusted
1 BERLIN 49.13

#### Solution (R to Python)

In [13]:
employees = ["Jake", "Bob", "Alice", "Matthias", "Sylvia"]
salaries = [233, 55, 123, 55, 61]

In [14]:
import numpy as np

In [15]:
salaries_yearly = np.array(salaries) * 12
salaries_square_root = np.sqrt(salaries)

In [16]:
def deduce_tax(salary):
    return(salary - 0.2 * salary)

In [17]:
salaries_without_tax = deduce_tax(salaries_yearly)

In [18]:
import pandas as pd

In [19]:
employee_df = pd.DataFrame(zip(employees, salaries, salaries_yearly, salaries_square_root, salaries_without_tax),
                          columns = ["employees", "salaries", "salaries_yearly", "salaries_square_root", "salaries_without_tax"])

In [20]:
employee_df

,employees,salaries,salaries_yearly,salaries_square_root,salaries_without_tax
0,Jake,233,2796,15.264338,2236.8
1,Bob,55,660,7.416198,528.0
2,Alice,123,1476,11.090537,1180.8
3,Matthias,55,660,7.416198,528.0
4,Sylvia,61,732,7.810250,585.6

## Text data with Python

In [1]:
import nltk
from nltk.corpus import stopwords
import spacy

stop_words = set(stopwords.words('english'))

In [2]:
paragraph = "The Real players wore shirts with \"A por la 14\" on the back after \
their win over Manchester City. It roughly translates as \"all out for 14\" as they \
chase a 14th Champions League title."

In [3]:
sentences = nltk.sent_tokenize(paragraph)

In [4]:
sentence = sentences[0]

In [5]:
words = nltk.word_tokenize(sentence)

In [6]:
cleaned_words = [w for w in words if not w.lower() in stop_words]

In [7]:
cleaned_words

['Real',
 'players',
 'wore',
 'shirts',
 '``',
 'por',
 'la',
 '14',
 "''",
 'back',
 'win',
 'Manchester',
 'City',
 '.']

In [8]:
cleaned_words = [word.lower() for word in cleaned_words if word.isalpha()]

In [10]:
nlp = spacy.load('en_core_web_sm')

In [11]:
doc = nlp(sentence)

In [12]:
[x for x in doc if x.pos_ == 'VERB']

[wore]

## Data wrangling with R

In [10]:
library(dplyr)

Attache Paket: ‘dplyr’


Die folgenden Objekte sind maskiert von ‘package:stats’:

    filter, lag


Die folgenden Objekte sind maskiert von ‘package:base’:

    intersect, setdiff, setequal, union

In [11]:
diamonds_df <- read.csv("../datasets/diamonds.csv")

In [12]:
head(diamonds_df)

  carat cut       color clarity depth table price x    y    z
1 0.23  Ideal     E     SI2     61.5  55    326   3.95 3.98 2.43
2 0.21  Premium   E     SI1     59.8  61    326   3.89 3.84 2.31
3 0.23  Good      E     VS1     56.9  65    327   4.05 4.07 2.31
4 0.29  Premium   I     VS2     62.4  58    334   4.20 4.23 2.63
5 0.31  Good      J     SI2     63.3  58    335   4.34 4.35 2.75
6 0.24  Very Good J     VVS2    62.8  57    336   3.94 3.96 2.48

In [13]:
diamonds_df %>%
    filter(price >= 500, color != 'J') %>%
    sample_frac(0.4) %>%
    group_by(cut) %>%
    summarize('Mean carat' = mean(carat))

  cut       Mean carat
1 Fair      1.0205667
2 Good      0.8546024
3 Ideal     0.6987617
4 Premium   0.8730248
5 Very Good 0.8127849